package com.shtrih.jpos.fiscalprinter;

import com.shtrih.fiscalprinter.command.TextReportStorage;
import org.junit.After;
import org.junit.Before;
import org.junit.Test;

import java.io.*;
import java.nio.charset.Charset;
import java.util.List;

import static org.junit.Assert.assertEquals;

/**
 * @author P.Zhirkov
 */
public class TextReportStorageTests {

    private File file;
    private TextReportStorage storage;

    @Before
    public void context() throws IOException {
        file = File.createTempFile("TextReportStorageTests", ".txt");

        storage = new TextReportStorage(file.getAbsolutePath());
    }

    @After
    public void cleanupContext() {
        file.delete();
    }

    @Test
    public void should_search_first_z_report() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        String expectedReport =
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(1));
    }

    @Test
    public void should_search_first_and_single_z_report() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n"
                );

        String expectedReport =
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(1));
    }

    @Test
    public void should_search_z_report_in_the_middle() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0237\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0018\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0239\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0156\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n" +
                "ККТ 1358                  ИНН 770123456789 №0240\n" +
                "13.02.17 13:25                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0008\n" +
                "Кружка                                          \n" +
                "01                                         =6.12\n" +
                "Кружка                                          \n" +
                "01                                         =9.66\n" +
                "Ложка                                           \n" +
                "01                                         =0.28\n" +
                "Ложка                                           \n" +
                "01                                         =3.46\n" +
                "Миска                                           \n" +
                "01                                         =1.22\n" +
                "Миска                                           \n" +
                "01                                         =2.93\n" +
                "                                                \n" +
                "ИТОГ                                      =23.67\n" +
                "КРЕДИТОМ                                  =23.67\n" +
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0243\n" +
                "13.02.17 13:27               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0157\n" +
                "Миска                                           \n" +
                "01                                         =2.53\n" +
                "Миска                                           \n" +
                "01                                         =7.96\n" +
                "Кружка                                          \n" +
                "01                                         =2.74\n" +
                "Нож                                             \n" +
                "01                                         =8.07\n" +
                "Миска                                           \n" +
                "01                                         =6.13\n" +
                "Нож                                             \n" +
                "01                                         =1.45\n" +
                "                                                \n" +
                "ИТОГ                                      =28.88\n" +
                "КРЕДИТОМ                                  =28.88\n"
        );

        String expectedReport =
                "ККТ 1358                  ИНН 770123456789 №0239\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0156\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n" +
                "ККТ 1358                  ИНН 770123456789 №0240\n" +
                "13.02.17 13:25                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0008\n" +
                "Кружка                                          \n" +
                "01                                         =6.12\n" +
                "Кружка                                          \n" +
                "01                                         =9.66\n" +
                "Ложка                                           \n" +
                "01                                         =0.28\n" +
                "Ложка                                           \n" +
                "01                                         =3.46\n" +
                "Миска                                           \n" +
                "01                                         =1.22\n" +
                "Миска                                           \n" +
                "01                                         =2.93\n" +
                "                                                \n" +
                "ИТОГ                                      =23.67\n" +
                "КРЕДИТОМ                                  =23.67\n" +
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(19));
    }

    @Test
    public void should_search_z_report_in_the_middle_when_previous_report_has_different_number_then_minus_one() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0237\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0239\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0156\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n" +
                "ККТ 1358                  ИНН 770123456789 №0240\n" +
                "13.02.17 13:25                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0008\n" +
                "Кружка                                          \n" +
                "01                                         =6.12\n" +
                "Кружка                                          \n" +
                "01                                         =9.66\n" +
                "Ложка                                           \n" +
                "01                                         =0.28\n" +
                "Ложка                                           \n" +
                "01                                         =3.46\n" +
                "Миска                                           \n" +
                "01                                         =1.22\n" +
                "Миска                                           \n" +
                "01                                         =2.93\n" +
                "                                                \n" +
                "ИТОГ                                      =23.67\n" +
                "КРЕДИТОМ                                  =23.67\n" +
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0243\n" +
                "13.02.17 13:27               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0157\n" +
                "Миска                                           \n" +
                "01                                         =2.53\n" +
                "Миска                                           \n" +
                "01                                         =7.96\n" +
                "Кружка                                          \n" +
                "01                                         =2.74\n" +
                "Нож                                             \n" +
                "01                                         =8.07\n" +
                "Миска                                           \n" +
                "01                                         =6.13\n" +
                "Нож                                             \n" +
                "01                                         =1.45\n" +
                "                                                \n" +
                "ИТОГ                                      =28.88\n" +
                "КРЕДИТОМ                                  =28.88\n"
        );

        String expectedReport =
                "ККТ 1358                  ИНН 770123456789 №0239\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0156\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n" +
                "ККТ 1358                  ИНН 770123456789 №0240\n" +
                "13.02.17 13:25                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0008\n" +
                "Кружка                                          \n" +
                "01                                         =6.12\n" +
                "Кружка                                          \n" +
                "01                                         =9.66\n" +
                "Ложка                                           \n" +
                "01                                         =0.28\n" +
                "Ложка                                           \n" +
                "01                                         =3.46\n" +
                "Миска                                           \n" +
                "01                                         =1.22\n" +
                "Миска                                           \n" +
                "01                                         =2.93\n" +
                "                                                \n" +
                "ИТОГ                                      =23.67\n" +
                "КРЕДИТОМ                                  =23.67\n" +
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(19));
    }

    @Test
    public void should_search_z_report_in_the_middle_with_no_documents() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0237\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0018\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0243\n" +
                "13.02.17 13:27               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0157\n" +
                "Миска                                           \n" +
                "01                                         =2.53\n" +
                "Миска                                           \n" +
                "01                                         =7.96\n" +
                "Кружка                                          \n" +
                "01                                         =2.74\n" +
                "Нож                                             \n" +
                "01                                         =8.07\n" +
                "Миска                                           \n" +
                "01                                         =6.13\n" +
                "Нож                                             \n" +
                "01                                         =1.45\n" +
                "                                                \n" +
                "ИТОГ                                      =28.88\n" +
                "КРЕДИТОМ                                  =28.88\n"
        );

        String expectedReport =
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(19));
    }

    @Test
    public void should_search_z_report_at_the_begining_with_no_documents() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0243\n" +
                "13.02.17 13:27               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0157\n" +
                "Миска                                           \n" +
                "01                                         =2.53\n" +
                "Миска                                           \n" +
                "01                                         =7.96\n" +
                "Кружка                                          \n" +
                "01                                         =2.74\n" +
                "Нож                                             \n" +
                "01                                         =8.07\n" +
                "Миска                                           \n" +
                "01                                         =6.13\n" +
                "Нож                                             \n" +
                "01                                         =1.45\n" +
                "                                                \n" +
                "ИТОГ                                      =28.88\n" +
                "КРЕДИТОМ                                  =28.88\n"
        );

        String expectedReport = 
                "ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n";

        assertEqual(expectedReport, storage.searchZReport(19));
    }

    @Test
    public void should_return_null_when_z_report_was_not_found() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0241\n" +
                "13.02.17 13:25               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0019\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0243\n" +
                "13.02.17 13:27               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0157\n" +
                "Миска                                           \n" +
                "01                                         =2.53\n" +
                "Миска                                           \n" +
                "01                                         =7.96\n" +
                "Кружка                                          \n" +
                "01                                         =2.74\n" +
                "Нож                                             \n" +
                "01                                         =8.07\n" +
                "Миска                                           \n" +
                "01                                         =6.13\n" +
                "Нож                                             \n" +
                "01                                         =1.45\n" +
                "                                                \n" +
                "ИТОГ                                      =28.88\n" +
                "КРЕДИТОМ                                  =28.88\n"
        );

        assertEquals(null, storage.searchZReport(42));
    }

    private void assertEqual(String expected, List<String> actual) {
        StringBuilder sb = new StringBuilder();
        for (String s : actual) {
            sb.append(s);
            sb.append("\n");
        }

        assertEquals(expected, sb.toString());
    }

    @Test
    public void should_search_document_by_number_at_document_start() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        String expectedReport = "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n";

        assertEqual(expectedReport, storage.getDocument(1));
    }

    @Test
    public void should_search_document_by_number_in_the_middle() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        String expectedReport = "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n";

        assertEqual(expectedReport, storage.getDocument(2));
    }

    @Test
    public void should_search_document_by_number_at_the_end() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        String expectedReport = "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n";

        assertEqual(expectedReport, storage.getDocument(4));
    }

    @Test
    public void should_return_null_when_document_was_not_found() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        assertEquals(null, storage.getDocument(55));
    }

    @Test
    public void should_search_current_shift_at_start() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n");

        String expectedReport = "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n";

        assertEqual(expectedReport, storage.getCurrentDayReport());
    }

    @Test
    public void should_search_current_shift_at_end() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n" +
                "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n");

        String expectedReport = "ККТ 1358                  ИНН 770123456789 №0004\n" +
                "13.02.17 13:24               СИСТ. АДМИНИСТРАТОР\n" +
                "ПРОДАЖА                                    №0002\n" +
                "Миска                                           \n" +
                "01                                         =6.23\n" +
                "                                                \n" +
                "ИТОГ                                       =6.23\n" +
                "КРЕДИТОМ                                   =6.23\n";

        assertEqual(expectedReport, storage.getCurrentDayReport());
    }

    @Test
    public void should_return_null_when_current_report_was_not_found() throws Exception {
        writeFile("ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:34                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0001\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ПРОДАЖА                                    №0001\n" +
                "Ложка                                           \n" +
                "01                                         =6.23\n" +
                "Ложка                                           \n" +
                "01                                         =0.87\n" +
                "Нож                                             \n" +
                "01                                         =0.62\n" +
                "Кружка                                          \n" +
                "01                                         =9.29\n" +
                "                                                \n" +
                "ИТОГ                                      =17.01\n" +
                "КРЕДИТОМ                                  =17.01\n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "ЧЕК АННУЛИРОВАН                                 \n" +
                "ККТ 1358                  ИНН 770123456789 №0002\n" +
                "06.02.17 15:35                          КАССИР 1\n" +
                "ВОЗВРАТ ПРОДАЖИ                            №0001\n" +
                "Ложка                                           \n" +
                "01                                         =3.25\n" +
                "Ложка                                           \n" +
                "01                                         =4.24\n" +
                "Нож                                             \n" +
                "01                                         =6.45\n" +
                "Нож                                             \n" +
                "01                                         =6.26\n" +
                "Нож                                             \n" +
                "01                                         =5.99\n" +
                "                                                \n" +
                "ИТОГ                                      =26.19\n" +
                "КРЕДИТОМ                                  =26.19\n" +
                "ККТ 1358                  ИНН 770123456789 №0003\n" +
                "13.02.17 13:23               СИСТ. АДМИНИСТРАТОР\n" +
                "СУТОЧНЫЙ ОТЧЕТ С ГАШЕНИЕМ                  №0001\n" +
                "НЕОБНУЛ.СУММА ПРОДАЖ НА НАЧ.СМЕНЫ           0.00\n" +
                "НЕОБНУЛ.СУММА ПОКУПОК НА НАЧ.СМЕНЫ          0.00\n" +
                "ЧЕКОВ ПРОДАЖ                                0000\n" +
                "0000                                        0.00\n"
                );


        assertEquals(null, storage.getCurrentDayReport());
    }

    private void writeFile(String text) throws IOException {
        OutputStreamWriter writer = new OutputStreamWriter(new FileOutputStream(file), Charset.forName("utf-8"));

        try {
            writer.write(text);
            writer.flush();
        } finally {
            writer.close();
        }
    }
}
